Pahka/PETnode/stm32f051_init.c
/*
 * Copyright 2012 Pekka Nikander.  See NOTICE for licensing information.
 */

/*
 * A data driven approach to initialise STM32F peripherals.
 */

#include <stm32f0xx.h>
#include <stm32f0xx_extra.h>

#include <stddef.h>
#include <assert.h>

#include "init.h"

#define D16(d, r, v)    DEVICE_REGISTER_INIT_STRUCT_VALUE16((d), r, (v))
#define D32(d, r, v)    DEVICE_REGISTER_INIT_STRUCT_VALUE32((d), r, (v))
#define M32(d, r, m, v) DEVICE_REGISTER_INIT_STRUCT_MASK_VALUE32((d), r, (m), (v))
#define W32(d, r, m, v) DEVICE_REGISTER_INIT_STRUCT_WAIT_VALUE32((d), r, (m), (v))


/* XXX: Do we really need mask here?   */
const struct device_register_init_masked_32bit reset_and_clock_control[] = {
    M32(RCC, APB1ENR,
        RCC_APB1ENR_TIM2EN   | RCC_APB1ENR_TIM3EN,
        RCC_APB1ENR_TIM2EN   | RCC_APB1ENR_TIM3EN),
    M32(RCC, APB2ENR,
        RCC_APB2ENR_TIM1EN   | RCC_APB2ENR_SYSCFGEN | RCC_APB2ENR_SPI1EN | RCC_APB2ENR_ADC1EN |
        RCC_APB2ENR_TIM15EN  | RCC_APB2ENR_TIM16EN  | RCC_APB2ENR_TIM17EN,
        RCC_APB2ENR_TIM1EN   | RCC_APB2ENR_SYSCFGEN | RCC_APB2ENR_SPI1EN | RCC_APB2ENR_ADC1EN |
        RCC_APB2ENR_TIM15EN  | RCC_APB2ENR_TIM16EN  | RCC_APB2ENR_TIM17EN),
    M32(RCC, AHBENR,
        RCC_AHBENR_GPIOAEN   | RCC_AHBENR_GPIOBEN   | RCC_AHBENR_GPIOCEN | RCC_AHBENR_GPIOFEN,
        RCC_AHBENR_GPIOAEN   | RCC_AHBENR_GPIOBEN   | RCC_AHBENR_GPIOCEN | RCC_AHBENR_GPIOFEN),
};

/*
 * Assign a given priority for an interrupt, and enable the interrupt.
 *
 * See page 4-7 of ARM DUI 0497A, Cortex-M0 Peripherals and
 * NVIC_SetPriority implementation in CMSIS/Include/core_cm0.h
 */
#define _NVIC_PRIO_SHIFT(prio) ((prio) << (8 - __NVIC_PRIO_BITS))
#define ENABLE_INTERRUPT(irq, prio)                                 \
    M32(NVIC, IP[_IP_IDX((irq))],                                   \
        (                         0x000000FF) << _BIT_SHIFT((irq)), \
        (_NVIC_PRIO_SHIFT(prio) & 0x000000FF) << _BIT_SHIFT((irq))  \
        ),                                                          \
    M32(NVIC, ISER[0],                                              \
        1 << (irq), /* NOP */                                       \
        1 << (irq)                                                  \
       )

const struct device_register_init_masked_32bit nvic[] = {
    ENABLE_INTERRUPT(TIM3_IRQn, 3),
    ENABLE_INTERRUPT(SPI1_IRQn, 3), /* Lowest priority */
};

/* Port A */
const struct device_register_init_static_32bit general_purpose_io_a[] = {
    D32(GPIOA, MODER,
        0
        | ! GPIO_MODER_MODER0    /* 00: PA0  Input  USER */
        | ! GPIO_MODER_MODER1    /* 00: PA1  Input  INT */
        |   GPIO_MODER_MODER2_1  /* 10: PA2  AF     TIM15 CH1 */
        |   GPIO_MODER_MODER3_0  /* 01: PA3  Output RESET */
        |   GPIO_MODER_MODER4_1  /* 10: PA4  AF     SPI NSS */
        |   GPIO_MODER_MODER5_1  /* 10: PA5  AF     SPI CLK */
        |   GPIO_MODER_MODER6_1  /* 10: PA6  AF     SPI MISO */
        |   GPIO_MODER_MODER7_1  /* 10: PA7  AF     SPI MOSI */
        |   GPIO_MODER_MODER9_1  /* 10: PA9  AF     USART1 TX */
        |   GPIO_MODER_MODER10_1 /* 10: PA10 AF     USART1_RX */
        |   GPIO_MODER_MODER13_1 /* 10: PA13 AF     SWDAT, reset-time value */
        |   GPIO_MODER_MODER14_1 /* 10: PA14 AF     SWCLK, reset-time value */
        ),
    D32(GPIOA, OTYPER,
        0
        | ! GPIO_OTYPER_OT_2     /* PA2 AF output   Push-pull */
        | ! GPIO_OTYPER_OT_3     /* PA3 GPIO output Push-pull */
        | ! GPIO_OTYPER_OT_4     /* PA4 SPI NSS     Push-pull */
        | ! GPIO_OTYPER_OT_5     /* PA5 SPI CLK     Push-pull */
        | ! GPIO_OTYPER_OT_7     /* PA7 SPI MOSI    Push-pull */
        | ! GPIO_OTYPER_OT_9     /* PA9 USART TX    Push-pull */
        ),
    /* See page 74 of DM39193 Doc ID 022265 Rev 3 STD32F051x data sheet */
    D32(GPIOA, OSPEEDR,
        0
        |   GPIO_OSPEEDER_OSPEEDR2
        |   GPIO_OSPEEDER_OSPEEDR3 
        |   GPIO_OSPEEDER_OSPEEDR4
        |   GPIO_OSPEEDER_OSPEEDR5
        |   GPIO_OSPEEDER_OSPEEDR7
        |   GPIO_OSPEEDER_OSPEEDR9
        |   GPIO_OSPEEDER_OSPEEDR13 /* Reset-time value */
        | ! GPIO_OSPEEDER_OSPEEDR14 /* Reset-time value */
        ),
    D32(GPIOA, PUPDR,
        0
        |   GPIO_PUPDR_PUPDR0_1  /* PA0  <- USER    pull down */
        |   GPIO_PUPDR_PUPDR1_0  /* PA1  <- INT     pull up */
        | ! GPIO_PUPDR_PUPDR2    /* PA2  -> Blue    no pull resistors */
        | ! GPIO_PUPDR_PUPDR3    /* PA3  -> RESET   no pull resistors */
        | ! GPIO_PUPDR_PUPDR4    /* PA4  -> CS      no pull resistors */
        | ! GPIO_PUPDR_PUPDR5    /* PA5  -> SCK     no pull resistors */
        |   GPIO_PUPDR_PUPDR6_1  /* PA6  <- MISO    pull down */
        | ! GPIO_PUPDR_PUPDR7    /* PA7  -> MOSI    no pull resistors */
        | ! GPIO_PUPDR_PUPDR9    /* PA9  -> TX      no pull resistors */
        |   GPIO_PUPDR_PUPDR10_1 /* PA10 <- RX      pull down */
        |   GPIO_PUPDR_PUPDR13_0 /* PA13 <> SWDAT   pull up,   reset-time value */
        |   GPIO_PUPDR_PUPDR14_1 /* PA10 <- SWCLK   pull down, reset-time value */
        ),
    D32(GPIOA, AFR[0],
        0
        | ! GPIO_AFRL_AFRL2      /* PA2  AF0 TIM15_CH1 */
        | ! GPIO_AFRL_AFRL4      /* PA4  AF0 SPI */
        | ! GPIO_AFRL_AFRL5      /* PA5  AF0 SPI */
        | ! GPIO_AFRL_AFRL6      /* PA6  AF0 SPI */
        | ! GPIO_AFRL_AFRL7      /* PA7  AF0 SPI */
        ),
    D32(GPIOA, AFR[1],
        0
#define GPIO_AFRL_AFRL1_AF1            ((uint32_t)0x00000010)
#define GPIO_AFRL_AFRL2_AF1            ((uint32_t)0x00000100)
        |   GPIO_AFRL_AFRL1_AF1  /* PA9  AF1 TX */
        |   GPIO_AFRL_AFRL2_AF1  /* PA10 AF1 RX */
        | ! GPIO_AFRL_AFRL5      /* PA13 AF0 SWD, reset-time value */
        | ! GPIO_AFRL_AFRL6      /* PA14 AF0 SWC, reset-time value */
        ),
};

/* Port B */
const struct device_register_init_static_32bit general_purpose_io_b[] = {
    D32(GPIOB, MODER,
        0
        |   GPIO_MODER_MODER1_1 | GPIO_MODER_MODER1_0
                                  /* 11: PB1   Analog */
        |   GPIO_MODER_MODER8_1   /* 10: PB8   AF */
        |   GPIO_MODER_MODER9_1   /* 10: PB9   AF */
        |   GPIO_MODER_MODER13_1  /* 10: PB13  AF */
        |   GPIO_MODER_MODER14_1  /* 10: PB14  AF */
        |   GPIO_MODER_MODER15_1  /* 10: PB15  AF */
        ),
    D32(GPIOB, OTYPER,
        0
        | ! GPIO_OTYPER_OT_8      /* PB8  GPIO output Push-pull */
        | ! GPIO_OTYPER_OT_9      /* PB9  GPIO output Push-pull */
        | ! GPIO_OTYPER_OT_13     /* PB13 GPIO output Push-pull */
        | ! GPIO_OTYPER_OT_14     /* PB14 GPIO output Push-pull */
        | ! GPIO_OTYPER_OT_15     /* PB15 GPIO output Push-pull */
        ),
    /* See page 74 of DM39193 Doc ID 022265 Rev 3 STD32F051x data sheet */
    D32(GPIOB, OSPEEDR,
        0
        | ! GPIO_OSPEEDER_OSPEEDR8
        | ! GPIO_OSPEEDER_OSPEEDR9
        | ! GPIO_OSPEEDER_OSPEEDR13
        | ! GPIO_OSPEEDER_OSPEEDR14
        | ! GPIO_OSPEEDER_OSPEEDR15
        ),
    D32(GPIOB, PUPDR,
        0
        | ! GPIO_PUPDR_PUPDR1   /* PB1  no pull resistors */
        | ! GPIO_PUPDR_PUPDR8   /* PB8  no pull resistors */
        | ! GPIO_PUPDR_PUPDR9   /* PB9  no pull resistors */
        | ! GPIO_PUPDR_PUPDR13  /* PB13 no pull resistors */
        | ! GPIO_PUPDR_PUPDR14  /* PB14 no pull resistors */
        | ! GPIO_PUPDR_PUPDR15  /* PB15 no pull resistors */
        ),
#define GPIO_AFRL_AFRL0_AF2            ((uint32_t)0x00000002)
#define GPIO_AFRL_AFRL1_AF2            ((uint32_t)0x00000020)
#define GPIO_AFRL_AFRL2_AF2            ((uint32_t)0x00000200)
#define GPIO_AFRL_AFRL3_AF2            ((uint32_t)0x00002000)
#define GPIO_AFRL_AFRL4_AF2            ((uint32_t)0x00020000)
#define GPIO_AFRL_AFRL5_AF2            ((uint32_t)0x00200000)
#define GPIO_AFRL_AFRL6_AF2            ((uint32_t)0x02000000)
#define GPIO_AFRL_AFRL7_AF2            ((uint32_t)0x20000000)
    D32(GPIOB, AFR[1],
        0
        |   GPIO_AFRL_AFRL0_AF2 /* PB8  AF2 TIM16_CH1  */
        |   GPIO_AFRL_AFRL1_AF2 /* PB9  AF2 TIM17_CH1  */
        |   GPIO_AFRL_AFRL5_AF2 /* PB13 AF2 TIM1_CH1N */
        |   GPIO_AFRL_AFRL6_AF2 /* PB14 AF2 TIM1_CH2N */
        |   GPIO_AFRL_AFRL7_AF2 /* PB15 AF2 TIM1_CH3N */
        ),
};

/* Port C -- Eval and debug functions, TIM15 */
const struct device_register_init_static_32bit general_purpose_io_eval[] = {
    D32(GPIOC, MODER,
        0
        |   GPIO_MODER_MODER0_1 | GPIO_MODER_MODER0_0
                                 /* 10: PC0  Analog */
        |   GPIO_MODER_MODER6_0  /* 01: PC6  Output Led4 */
        |   GPIO_MODER_MODER7_0  /* 01: PC7  Output Led4 */
        |   GPIO_MODER_MODER8_0  /* 01: PC8  Output Led4 */
        |   GPIO_MODER_MODER9_0  /* 01: PC9  Output Led3 */
        |   GPIO_MODER_MODER10_0 /* 01: PC10 Output Led2 */
        |   GPIO_MODER_MODER11_0 /* 01: PC11 Output Led1 */
        |   GPIO_MODER_MODER12_0 /* 01: PC12 Output Led0 */
        | ! GPIO_MODER_MODER13   /* 00: PC13 Input  WOL  */
        ),
    D32(GPIOC, OTYPER,
        0
        | ! GPIO_OTYPER_OT_6     /* PC6  GPIO output Push-pull */
        | ! GPIO_OTYPER_OT_7     /* PC7  GPIO output Push-pull */
        | ! GPIO_OTYPER_OT_8     /* PC8  GPIO output Push-pull */
        | ! GPIO_OTYPER_OT_9     /* PC9  GPIO output Push-pull */
        | ! GPIO_OTYPER_OT_10    /* PC10 GPIO output Push-pull */
        | ! GPIO_OTYPER_OT_11    /* PC11 GPIO output Push-pull */
        | ! GPIO_OTYPER_OT_12    /* PC12 GPIO output Push-pull */
        ),
    /* See page 74 of DM39193 Doc ID 022265 Rev 3 STD32F051x data sheet */
    D32(GPIOC, OSPEEDR,
        0
        | ! GPIO_OSPEEDER_OSPEEDR6  /* 00: PC6 GPIO */
        | ! GPIO_OSPEEDER_OSPEEDR7  /* 00: PC7 GPIO */
        | ! GPIO_OSPEEDER_OSPEEDR8  /* 00: PC8 GPIO */
        | ! GPIO_OSPEEDER_OSPEEDR9  /* 00: PC9 GPIO */
        | ! GPIO_OSPEEDER_OSPEEDR10 /* 00: PC10 GPIO */
        | ! GPIO_OSPEEDER_OSPEEDR11 /* 00: PC11 GPIO */
        | ! GPIO_OSPEEDER_OSPEEDR12 /* 00: PC12 GPIO */
        ),
    D32(GPIOC, PUPDR,
        0
        | ! GPIO_PUPDR_PUPDR6    /* PC6  -> Led6    no pull resistors */
        | ! GPIO_PUPDR_PUPDR7    /* PC7  -> Led5    no pull resistors */
        | ! GPIO_PUPDR_PUPDR8    /* PC8  -> Led4    no pull resistors */
        | ! GPIO_PUPDR_PUPDR9    /* PC9  -> Led3    no pull resistors */
        | ! GPIO_PUPDR_PUPDR10   /* PC9  -> Led2    no pull resistors */
        | ! GPIO_PUPDR_PUPDR11   /* PC9  -> Led1    no pull resistors */
        | ! GPIO_PUPDR_PUPDR12   /* PC9  -> Led0    no pull resistors */
        | ! GPIO_PUPDR_PUPDR13_0 /* PC13 <- WOL     pull up*/
        ),
};

