Pahka/PETnode/stm32f051_init.c
/*
 * Timer-counter for LED buck converter.
 */
const struct device_register_init_static_16bit rgb_buck_pwm[] = {
    D16(TIM15, CR1, 0),         /* Disable the counter */
    // D16(TIM15, CR2, 0),      /* Default value */
    // D16(TIM16, SMCR, 0),     /* Default value */
    // D16(TIM15, DIER, 0),     /* Default value */
    D16(TIM15, CCMR1,
        0
        |   TIM_CCMR1_OC1M_PWM2 /* 111 = CH1 PWM Mode 2 */
        |   TIM_CCMR1_OC1PE     /* 1   = CH1 preload register in use */
        |   TIM_CCMR1_OC1FE     /* 1   = CH1 compare fast mode enabled */
        | ! TIM_CCMR1_CC1S      /* 00  = CH1 is output */
        ),
    // D16(TIM15, CCMR2, 0),    /* Default value */
    D16(TIM15, CCER,
        0
        | ! TIM_CCER_CC1NP      /* 0   = OC1N active high */
        | ! TIM_CCER_CC1NE      /* 0   = OC1N is not output */
        | ! TIM_CCER_CC1P       /* 0   = OC1  active high */
        |   TIM_CCER_CC1E       /* 1   = OC1  is actively output */
        ),
    D16(TIM15, BDTR,
        0
        |   TIM_BDTR_MOE        /* 1   = Main output enable */
        |   TIM_BDTR_AOE        /* 1   = Automatic output enable */
        | ! TIM_BDTR_BKP        /* 0   = BRK is active low, default value */
        | ! TIM_BDTR_BKE        /* 0   = Break inputs disabled */
        |   TIM_BDTR_OSSR       /* 1   = OC/OCN outputs are enabled */
        |   TIM_BDTR_OSSI       /* 1   = OC/OCN outputs are forced to idle level when inactive */
        | ! TIM_BDTR_LOCK       /* 00  = No bits are write proteced */
        | ! TIM_BDTR_DTG        /* 0   = No dead time */
        ),

    D16(TIM15, PSC,     4),     /* 48MHz / (4+1) = approx 10 MHz (9.60 MHz) */
    D16(TIM15, ARR,   480),     /* 9.6 MHz / 480 = 20 kHz */
    D16(TIM15, CCR1,  481),     /* Boot with 0% duty */

    D16(TIM15, CR1,
        0
        | ! TIM_CR1_CKD         /* 00 = Clock divide by 1 */
        |   TIM_CR1_ARPE        /* 1  = Auto-reload preload enabled, ARR buffered */
        | ! TIM_CR1_OPM         /* 0  = Continuous */
        | ! TIM_CR1_URS         /* 0  = All UEV sources generate interrupt, if enabled */
        | ! TIM_CR1_UDIS        /* 0  = Update events are generated, shadow registers updated */
        |   TIM_CR1_CEN         /* 1  = Enable the counter */
        ),
};

#if 0
XXX Doesnt work currently, must fix SPI interrupt tolerance first
/*
 * Timer-counter for interrupt timer
 */
const struct device_register_init_static_16bit interrupt_timer[] = {
    D16(TIM3, CR1, 0),        /* Disable the counter */
    D16(TIM3, CR2,
        0
        | ! TIM_CR2_TI1S      /* 0 = CH1 is connected to TI1 */
        | ! TIM_CR2_MMS       /* 000 = "Reset." TRGO from UG */
        | ! TIM_CR2_CCDS      /* 0 = DMA when CCX event */
        ),
    D16(TIM3, SMCR, 0),
    D16(TIM3, DIER,
        0
        |   TIM_DIER_UIE       /* 1 = Update interrupt enabled */
        ),
    D16(TIM3, CCMR1, 0),
    D16(TIM3, CCMR2, 0),
    D16(TIM3, CCER, 0),

    /*
     * Note that TIM3 ARR and CCR registers are 32-bits long, but here we
     * initialize them with only 16-bits long values
     */
    D16(TIM3, ARR,   1000),   /* 1 MHz / 20 = 50 kHz  XXX */
    D16(TIM3, PSC,    47),    /* 48MHz / 48  = 1 MHz */

    D16(TIM3, CR1,
        0
        | ! TIM_CR1_CKD       /* 00 = Clock divide by 1 */
        |   TIM_CR1_ARPE      /* 1  = Auto-reload preload enabled, ARR buffered */
        | ! TIM_CR1_CMS       /* 00 = Edge aligned mode */
        |   TIM_CR1_DIR       /* 1  = Down counter */
        | ! TIM_CR1_OPM       /* 0  = Continuous */
        | ! TIM_CR1_URS       /* 0  = All UEV sources */
        | ! TIM_CR1_UDIS      /* 0  = Enable UEV */
        |   TIM_CR1_CEN       /* Enable the counter */
        ),
};
#endif

/* SPI */
const struct device_register_init_static_16bit spi[] = {
    D16(SPI1, CR2,
        0
        | ! SPI_CR2_RXDMAEN    /* Disable RX DMA */
        | ! SPI_CR2_TXDMAEN    /* Disable TX DMA */
        |   SPI_CR2_SSOE       /* NSS output automatically managed by hardware */
        | ! SPI_CR2_NSSP       /* Default: NO NSS pulse */
        | ! SPI_CR2_FRF        /* SPI Motorola mode */
        | ! SPI_CR2_ERRIE      /* Error interrupt disabled */
        | ! SPI_CR2_RXNEIE     /* RX buffer not empty interrupt disabled */
        | ! SPI_CR2_TXEIE      /* TX buffer empty interrupt disabled */
        /* 0111: 8 bits data size */
        |   SPI_CR2_DS_2 | SPI_CR2_DS_1 | SPI_CR2_DS_0
        | ! SPI_CR2_FRXTH      /* 0: RXNE goes high with two bytes */
        | ! SPI_CR2_LDMARX     /* N/A: RX DMA even */
        | ! SPI_CR2_LDMATX     /* N/A: TX DMA even */
        ),
    D16(SPI1, CR1,
        0
        | ! SPI_CR1_CPHA       /* Data at first edge */
        | ! SPI_CR1_CPOL       /* Clock low when idle */
        |   SPI_CR1_MSTR       /* Master mode */
        |   SPI_CR1_BR_1       /* Clock divider 8 */
        | ! SPI_CR1_SPE        /* SPI disabled until used */
        | ! SPI_CR1_LSBFIRST   /* MSB first */

        |   SPI_CR1_SSI        /* Internal NSS high, needed for master mode */
        | ! SPI_CR1_SSM        /* Hardware Slave management enabled */
        | ! SPI_CR1_RXONLY     /* 0: Full duplex */
        | ! SPI_CR1_CRCL       /* 0: N/A (8-bit CRC length) */
        | ! SPI_CR1_CRCNEXT    /* 0: Transmit TX buffer, not CERC */
        | ! SPI_CR1_CRCEN      /* 0: CRC disabled */
        |   SPI_CR1_BIDIOE     /* 1: Output enabled */
        | ! SPI_CR1_BIDIMODE   /* 0: 2-Line (uni)directional data */
        ),
};

/* ADC */
const struct device_register_init_static_32bit adc_start_calibrate[] = {
    D32(ADC1, CR,
        0
        |   ADC_CR_ADCAL       /* 1: Start calibration now */
        | ! ADC_CR_ADSTP       /* 0: Do not attempt to stop ADC conversion  */
        | ! ADC_CR_ADSTART     /* 0: Do not attempt to start ADC conversion  */
        | ! ADC_CR_ADDIS       /* 0: Do not attempt to disable ADC */
        | ! ADC_CR_ADEN        /* 0: Do not attempt to enable ADC */
        ),
};

/* Wait for the ADC calibrate to finish */
const struct device_register_init_waited_32bit adc_wait_for_calibrate[] = {
    W32(ADC1, CR, ADC_CR_ADCAL, 0),
};

const struct device_register_init_static_32bit adc_init[] = {
    D32(ADC1, IER,
        0
        | ! ADC_IER_AWDIE      /* 0: No analog watchdog interrupts XXX */
        | ! ADC_IER_OVRIE      /* 0: No overrun interrupts */
        | ! ADC_IER_EOSEQIE    /* 0: No end of sequence interrupst XXX */
        | ! ADC_IER_EOCIE      /* 0: No end of conversion interrupts */
        | ! ADC_IER_EOSMPIE    /* 0: No end of sampling flag interrupts */
        | ! ADC_IER_ADRDYIE    /* 0: No ADC ready interrupts */
        ),
    D32(ADC1, CR,
        0
        | ! ADC_CR_ADCAL       /* 0: Do not attempt to calibrate */
        | ! ADC_CR_ADSTP       /* 0: Do not attempt to stop ADC conversion  */
        | ! ADC_CR_ADSTART     /* 0: Do not attempt to start ADC conversion  */
        | ! ADC_CR_ADDIS       /* 0: Do not attempt to disable ADC */
        |   ADC_CR_ADEN        /* 0: Enable ADC */
        ),
    D32(ADC1, CFGR1,
        0
        | ! ADC_CFGR1_AWDCH    /* 00000: Default value */
        | ! ADC_CFGR1_AWDEN    /* 0: Analog watchdog disable */
        | ! ADC_CFGR1_AWDSGL   /* 0: Analog watchdog on all channels */
        | ! ADC_CFGR1_DISCEN   /* 0: Discontinuous mode disabled */
        | ! ADC_CFGR1_AUTOFF   /* 0: Auto-off mode disabled */
        | ! ADC_CFGR1_WAIT     /* 0: Wait conversion mode off */
        |   ADC_CFGR1_CONT     /* 1: Continuous conversion mode */
        |   ADC_CFGR1_OVRMOD   /* 1: ADC_DR is overwritten with latest value */
        | ! ADC_CFGR1_EXTEN    /* 00: Conversion started by software */
        | ! ADC_CFGR1_EXTSEL   /* 000: Default value */
        | ! ADC_CFGR1_ALIGN    /* 0: Right alignment */
        | ! ADC_CFGR1_RES      /* 00: 12-bits resolution */
        | ! ADC_CFGR1_SCANDIR  /* 0: Upward scan */
        | ! ADC_CFGR1_DMACFG   /* 0: N/A, DMA not used */
        | ! ADC_CFGR1_DMAEN    /* 0: DMA disabled */
        ),
    D32(ADC1, CFGR2,
        0
        |   ADC_CFGR2_JITOFFDIV4 /* 1: Remove jitter when ADC is driven by PCLK/4 */
        | ! ADC_CFGR2_JITOFFDIV2 /* 0: No jitter removal on PCLK/2 */
        ),
    D32(ADC1, SMPR, 0),          /* 1.5 ADC clock cycles sampling time */
    D32(ADC1, CHSELR,
        0
        | ! ADC_CHSELR_CHSEL17 /* 0: Channel 17 not selected for conversion */
        | ! ADC_CHSELR_CHSEL16 /* 0: Channel 16 not selected for conversion */
        | ! ADC_CHSELR_CHSEL15 /* 0: Channel 15 not selected for conversion */
        | ! ADC_CHSELR_CHSEL14 /* 0: Channel 14 not selected for conversion */
        | ! ADC_CHSELR_CHSEL13 /* 0: Channel 13 not selected for conversion */
        | ! ADC_CHSELR_CHSEL12 /* 0: Channel 12 not selected for conversion */
        | ! ADC_CHSELR_CHSEL11 /* 0: Channel 11 not selected for conversion */
        |   ADC_CHSELR_CHSEL10 /* 1: Channel 10 selected for conversion Blue  */
        |   ADC_CHSELR_CHSEL9  /* 1: Channel  9 selected for conversion Green */
        |   ADC_CHSELR_CHSEL8  /* 1: Channel  8 selected for conversion Red   */
        | ! ADC_CHSELR_CHSEL7  /* 0: Channel  7 not selected for conversion */
        | ! ADC_CHSELR_CHSEL6  /* 0: Channel  6 not selected for conversion */
        | ! ADC_CHSELR_CHSEL5  /* 0: Channel  5 not selected for conversion */
        | ! ADC_CHSELR_CHSEL4  /* 0: Channel  4 not selected for conversion */
        | ! ADC_CHSELR_CHSEL3  /* 0: Channel  3 not selected for conversion */
        | ! ADC_CHSELR_CHSEL2  /* 0: Channel  2 not selected for conversion */
        | ! ADC_CHSELR_CHSEL1  /* 0: Channel  1 not selected for conversion */
        | ! ADC_CHSELR_CHSEL0  /* 0: Channel  0 not selected for conversion */
        ),
};

const struct device_register_init_static_32bit adc_init2[] = {
    D32(ADC, CCR,
        0
        | ! ADC_CCR_VBATEN     /* 0: VBAT channel disabled */
        | ! ADC_CCR_TSEN       /* 0: Temperature sensor disabled */
        | ! ADC_CCR_VREFEN     /* 0: VREFINT channel disable */
        ),
};

