Pahka/PETnode/stm32f051_init.c
/*
 * Master initialisation table
 */
const device_register_init_descriptor_t dri_tables[] = {
    DRI_DESCRIPTOR_MASKED_32BIT(RCC,   reset_and_clock_control),
    DRI_DESCRIPTOR_MASKED_32BIT(NVIC,  nvic),
    DRI_DESCRIPTOR_STATIC_32BIT(ADC1,  adc_start_calibrate),
    DRI_DESCRIPTOR_STATIC_16BIT(SPI1,  spi),
#if 0
    DRI_DESCRIPTOR_STATIC_16BIT(TIM3,  interrupt_timer),
#endif
    DRI_DESCRIPTOR_STATIC_32BIT(GPIOA, general_purpose_io_a),
    DRI_DESCRIPTOR_STATIC_32BIT(GPIOB, general_purpose_io_b),
    DRI_DESCRIPTOR_STATIC_32BIT(GPIOC, general_purpose_io_eval),
    DRI_DESCRIPTOR_WAITED_32BIT(ADC1,  adc_wait_for_calibrate),
    DRI_DESCRIPTOR_STATIC_32BIT(ADC1,  adc_init),
    DRI_DESCRIPTOR_STATIC_32BIT(ADC,   adc_init2),
};

/*
 * The APB bus appears to be a 32-bit bus, always using 32-bit access.
 * There are four sets of evidence for this.  Firstly, using the
 * 32-bit writes below work even for 16-bit registers.  Secondly, all
 * the 16-bit registers are defined as the high-order 16 bits being
 * reserved.  Thirdly, at least some of the APB peripherial
 * descriptions say the following:
 *
 * RM0091, Doc ID 018940 Rev 2, page 332:
 *
 * The peripheral registers can be accessed by half-words (16-bit)
 * or words (32-bit).
 *
 * Finally, when describing the AHB2APB bridge and then the DMA
 * controller access to the APB devices, the manual says the following:
 *
 * RM0091, Doc ID 018940 Rev 2, page 36:
 *
 * Note: When a 16- or 8-bit access is performed on an APB register,
 * the access is transformed into a 32-bit access: the bridge
 * duplicates the 16- or 8-bit data to feed the 32-bit vector.
 *
 * RM0091, Doc ID 018940 Rev 2, page 149:
 *
 * Assuming that the AHB/APB bridge is an AHB 32-bit slave peripheral
 * that does not take the HSIZE data into account, it will transform
 * any AHB byte or halfword operation into a 32-bit APB operation in
 * the following manner:
 * - an AHB byte write operation of the data "0xB0" to 0x0 (or to 0x1,
 *   0x2 or 0x3) will be converted to an APB word write operation of
 *   the data "0xB0B0B0B0" to 0x0
 * - an AHB halfword write operation of the data "0xB1B0" to 0x0 (or
 *   to 0x2) will be converted to an APB word write operation of the
 *   data "0xB1B0B1B0" to 0x0
 *
 * Consequently, our current assumption is that it is safe to write
 * even the 16-bit APB registers with 32-bit writes, and we do so.
 */

static inline void
Config_Static16(void *device, const device_register_init_static_16bit_t *values, const int count) {
    const device_register_init_static_16bit_t *p;

    for (p = values; p < values + count; p++) {
        *((uint32_t *)(((char *)device) + p->offset)) = p->value;
    }
}

static inline void
Config_Static32(void *device, const device_register_init_static_32bit_t *values, const int count) {
    const device_register_init_static_32bit_t *p;

    for (p = values; p < values + count; p++) {
        *((uint32_t *)(((char *)device) + p->offset)) = p->value;
    }
}

static inline void
Config_Masked32(void *device, const device_register_init_masked_32bit_t *values, const int count) {
    const device_register_init_masked_32bit_t *p;

    for (p = values; p < values + count; p++) {
        register uint32_t *const reg               /* Pointer to the device register */
            = (uint32_t *)(((char *)device) + p->offset);

        // XXX: assert that no bits in p->value are outside of p->mask

        register uint32_t tmp;

        tmp  = *reg;
        tmp &= ~p->mask;
        tmp |=  p->value;
        *reg = tmp;
    }
}

/*
 * Wait for the given words to have the given masked values
 */
static inline void
Config_Waited32(void *device, const device_register_init_masked_32bit_t *values, const int count) {
    const device_register_init_masked_32bit_t *p;

    for (p = values; p < values + count; p++) {
        register const uint32_t value = p->value;  /* Waited for value */
        register uint32_t * const reg              /* Pointer to the device register */
            = (uint32_t *)(((char *)device) + p->offset);

        register uint32_t tmp;

        do {
            tmp  = *reg;
            tmp &= ~p->mask;
        } while (value != tmp);
    }
}

void
Peripheral_Init(void) {
    for (unsigned int i = 0; i < COUNT_OF(dri_tables); i++) {
        const device_register_init_descriptor_t *dri = &dri_tables[i];
        switch (dri->dri_type) {
        case DRI_WAITED_32BIT:
            Config_Waited32(dri->dri_device, dri->dri_masked_32bit, dri->dri_count);
            break;
        case DRI_MASKED_32BIT:
            Config_Masked32(dri->dri_device, dri->dri_masked_32bit, dri->dri_count);
            break;
        case DRI_STATIC_32BIT:
            Config_Static32(dri->dri_device, dri->dri_static_32bit, dri->dri_count);
            break;
        case DRI_STATIC_16BIT:
            Config_Static16(dri->dri_device, dri->dri_static_16bit, dri->dri_count);
            break;
        default:
            abort();
            break;
        }
    }

    Config_Static16(TIM15, rgb_buck_pwm, COUNT_OF(rgb_buck_pwm));
    /* Start next timers suitably delayed */
    while (TIM15->ARR < 120)
        ;

    Config_Static16(TIM16, rgb_buck_pwm, COUNT_OF(rgb_buck_pwm));
    /* Start next timers suitably delayed */
    while (TIM16->ARR < 120)
        ;

    Config_Static16(TIM17, rgb_buck_pwm, COUNT_OF(rgb_buck_pwm));
}

